Revit 2027 API
FilteredElementCollector.Excluding Method
 Applies an ExclusionFilter to the collector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FilteredElementCollector Excluding(
	ICollection<ElementId> idsToExclude
)
Public Function Excluding (
	idsToExclude As ICollection(Of ElementId)
) As FilteredElementCollector
public:
FilteredElementCollector^ Excluding(
	ICollection<ElementId^>^ idsToExclude
)
member Excluding :
        idsToExclude : ICollection<ElementId> -> FilteredElementCollector
Parameters
idsToExclude ICollection<ElementId>
 The ids to exclude from the results.
Return Value
FilteredElementCollector
 A handle to this collector. This is the same collector that has just been modified, returned so you can chain multiple calls together in one line.
Exceptions
Exception | Condition
ArgumentException |  The input collection of ids was empty, or its contents were not valid for iteration.
ArgumentNullException |  A non-optional argument was null
Remarks
 Elements passed to this filter will be automatically excluded from the results. If you have an active iterator to this collector it will be stopped by this call.
See Also
Reference
FilteredElementCollector Class
Autodesk.Revit.DB Namespace